In [66]:
import pandas as pd
import numpy as np

df = pd.read_csv('/home/lf/mysql_data/100.csv')

tmp = df.head(10)

In [79]:
tmp[-(tmp['money']>=10000)].dtypes

job_place    object
money         int64
dtype: object

In [91]:
a_values=[['小明','male',18,170,60,'北京海淀',61],
          ['小华','female',28,160,50,'上海静安',74],
          ['小红','female',22,175,64,'广州天河',59],
          ['小青','male',31,182,80,'深圳南山',82],
          ['小兰','female',25,165,65,'杭州西湖',98]]

In [94]:
a= pd.DataFrame(a_values,index=[1,2,3,4,5],columns=['name','sex','age','height','weight','address','grade'])

In [149]:
b = a.copy()

In [141]:
b.loc['aaa']=['小芳','female',24,164,52,'美国加州',55]

In [142]:
b.drop('aaa',axis=0)

  name     sex  age  height  weight address  grade
1   小明    male   18     170      60    北京海淀     61
2   小华  female   28     160      50    上海静安     74
3   小红  female   22     175      64    广州天河     59
4   小青    male   31     182      80    深圳南山     82
5   小兰  female   25     165      65    杭州西湖     98

In [117]:
b

    name     sex  age  height  weight address  grade
1     小明    male   18     170      60    北京海淀     61
2     小华  female   28     160      50    上海静安     74
3     小红  female   22     175      64    广州天河     59
4     小青    male   31     182      80    深圳南山     82
5     小兰  female   25     165      65    杭州西湖     98
aaa   小芳  female   24     164      52    美国加州     55

In [121]:
s = pd.Series([1,2,3,4,5])

In [153]:
b.columns.name='信息'
b.index.name='序号'

In [172]:
b.to_csv('z.csv',index=False,header=False,columns=['name','sex'],rows=[1,2])

TypeError: to_csv() got an unexpected keyword argument 'rows'

   小明    male
0  小华  female
1  小红  female
2  小青    male
3  小兰  female